[
  {
    "title" : "Ginger shakin' beef",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/55846371.jpg",
    "likes" : "50k",
    "time" : "16 Minutes ",
    "Difficulty":"Not Too Tricky",
    "serves":"2",
    "calories":"373",
    "fat":"19.8 g",
    "protein":"35.7 g",
    "ingredients": [
      {
        "quantity": "300",
        "measure": "g",
        "name": " sirloin steak"
      },
      {
        "quantity": "1",
        "measure": "tablespoon",
        "name": "miso paste"
      },
      {
        "quantity": "4",
        "measure": "cm piece",
        "name": "ginger"
      },
      {
        "quantity": "2",
        "measure": "teaspoons",
        "name": "runny honey"
      },
      {
        "quantity": "250",
        "measure": "g",
        "name": "pak choi"
      }
    ],
    "steps": [
      "Pull the fat off the sirloin.",
      "Finely slice the fat and place it in a cold non-stick frying pan.",
      "Put on a medium-high heat to crisp up while you peel and matchstick the ginger, then add that to crisp up, too.",
      "Cut off the sinew, then dice the steak into 3cm chunks and toss with the miso until well coated.",
      "Scoop the crispy fat and ginger out and put aside, then add the steak chunks to the pan",
      "Cook for 4 minutes, tossing regularly, then drizzle in the honey and 1 tablespoon of red wine vinegar.",
      "Toss for 1 more minute until shiny and sticky."
    ]
  },
  {
    "title" : "Chicken katsu",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/56393291.jpg",
    "likes" : "63k",
    "time" : "25 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"2",
    "calories":"816",
    "fat":"34.8 g",
    "protein":"46.7 g",
    "ingredients": [
      {
        "quantity": "2",
        "measure": " units",
        "name": " chicken breasts"
      },
      {
        "quantity": "2",
        "measure": " tablespoon",
        "name": "flour"
      },
      {
        "quantity": "1",
        "measure": " large unit",
        "name": "egg"
      },
      {
        "quantity": "100",
        "measure": " g",
        "name": "breadcrumbs"
      },
      {
        "quantity": "450",
        "measure": "g jar",
        "name": "curry sauce"
      },
      {
        "quantity": "100",
        "measure": " ml",
        "name": "chicken stock"
      },
      {
        "quantity": "2",
        "measure": "tablespoons",
        "name": "soy sauce"
      },
      {
        "quantity": "2",
        "measure": "tablespoons",
        "name": "vinegar"
      },
      {
        "quantity": "2",
        "measure": " units",
        "name": "onions"
      },
      {
        "quantity": "100",
        "measure": " ml",
        "name": "sunflower oil"
      }

    ],
    "steps": [
      "Lay the chicken breasts on a large sheet of greaseproof paper, cover with another sheet and bash flat with a rolling pin, until about 1cm thick.",
      "Tip the flour onto a plate and season with sea salt and black pepper. Beat the egg in a shallow dish with a pinch of salt, then tip the panko onto a plate. Coat the chicken breasts in the flour, then in the beaten egg, shaking off any excess, and press into the breadcrumbs to coat. Set aside while you make the pickle.",
      "Peel the carrot and cut into matchsticks. Halve the cucumber, deseed and thinly slice. Trim and slice the radishes. Combine in a bowl with the rice vinegar, sugar, sesame seeds and a pinch of salt.",
      "Strain the curry sauce into a pan and bring to a simmer. Add the chicken stock, soy sauce and rice vinegar. Reduce the heat and simmer for 3 minutes. Trim and slice the spring onions and set aside.",
      "Scoop the crispy fat and ginger out and put aside, then add the steak chunks to the pan",
      "Heat the sunflower oil in a large frying pan until simmering hot. Carefully add the coated chicken breasts and cook for 2 to 3 minutes on one side, until golden and crisp. Turn and cook the other side until the chicken is cooked through. Remove from the pan and transfer to kitchen paper to drain.",
      "Slice each chicken breast into strips and serve with the sauce, and the sliced spring onions and pickle on top. Delicious with a mound of sticky rice."
    ]
  },
  {
    "title" : "Pork meatballs",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/4yJRyoK9Kkn95DVucO28V2.jpg",
    "likes" : "13k",
    "time" : "1H 15 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"4",
    "calories":"591",
    "fat":"15.7 g",
    "protein":"49.1 g",
    "ingredients": [
      {
        "quantity": "30",
        "measure": " g",
        "name": " fresh mint"
      },
      {
        "quantity": "400",
        "measure": "g",
        "name": "beans"
      },
      {
        "quantity": "450",
        "measure": " g",
        "name": " pork fillet"
      },
      {
        "quantity": "2",
        "measure": "teaspoons",
        "name": "mustard"
      },
      {
        "quantity": "50",
        "measure": "g",
        "name": "oats"
      },
      {
        "quantity": "10",
        "measure": " ml",
        "name": "olive oil"
      },
      {
        "quantity": "2",
        "measure": " units",
        "name": "red onion"
      },
      {
        "quantity": "2",
        "measure": " units",
        "name": "apples"
      },
      {
        "quantity": "1",
        "measure": "tablespoon",
        "name": "Worcestershire sauce"
      },
      {
        "quantity": "2",
        "measure": "tablespoons",
        "name": " flour"
      },
      {
        "quantity": "1",
        "measure": " L",
        "name": " chicken stock"
      },
      {
        "quantity": "4",
        "measure": " units",
        "name": " wholemeal buns"
      },
      {
        "quantity": "30",
        "measure": " g",
        "name": " Cheddar cheese"
      },
      {
        "quantity": "100",
        "measure": " g",
        "name": " watercress"
      }
    ],
    "steps": [
      "Preheat the oven to 200°C",
      "Pick the mint leaves and put half into a food processor, popping the rest into a cup of cold water for later.",
      "Drain the beans, roughly chop the pork fillet, and add both to the processor with 1 heaped teaspoon of mustard, the oats and a pinch of sea salt and black pepper.",
      "Blitz into a coarse mince (don’t go too fine – keep it light and chunky in texture), then tip onto a board and roll into a long sausage. Chop into four equal pieces, divide each into five and, with wet hands, roll into twenty balls.",
      "To start your gravy, put 1 tablespoon of oil into a large high-sided roasting tray on a medium-high heat and add four of the balls, breaking them up with a wooden spoon.",
      "Peel and quarter the onions, break apart into petals and add to the tray, stirring regularly. Cut the apples into thin wedges, discarding the core, and stir them in, too.",
      "Cook it all for 5 minutes, then stir in the Worcestershire sauce and the remaining heaped teaspoon of mustard, followed by the flour.",
      "Stir for 2 minutes, then gradually stir in the stock, season and bring to the boil (it might seem like a lot of liquid, but it will reduce right down as it bakes).",
      "Plop in the remaining balls, spacing them out evenly, then transfer to the oven for 25 minutes, or until golden, shaking the tray halfway through. Warm the buns alongside for the last 5 minutes.",
      "Remove the tray from the oven and finely grate the Cheddar over the balls to melt. Drain and toss the remaining mint leaves with the watercress and/or rocket, and serve it all together, dunking the buns in the gravy as you tuck in."
    ]
  },
  {
    "title" : "Roast tikka chicken",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/55846380.jpg",
    "likes" : "120k",
    "time" : "1H 15 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"4",
    "calories":"467",
    "fat":"15.9 g",
    "protein":"42.3 g",
    "ingredients": [
      {
        "quantity": "800",
        "measure": "g",
        "name": " potatoes"
      },
      {
        "quantity": "600",
        "measure": " g",
        "name": "cauliflower"
      },
      {
        "quantity": "30",
        "measure": "g",
        "name": "coriander"
      },
      {
        "quantity": "2",
        "measure": "teaspoons",
        "name": "runny honey"
      },
      {
        "quantity": "1",
        "measure": " Kg",
        "name": "chicken"
      },
      {
        "quantity": "2",
        "measure": " tablespoons",
        "name": "tikka curry paste"
      },
      {
        "quantity": "1",
        "measure": " tablespoons",
        "name": "red wine vinegar"
      },
      {
        "quantity": "1",
        "measure": " tablespoons",
        "name": "red wine vinegar"
      }
    ],
    "steps": [
      "Preheat the oven to 180ºC.",
      "Wash the potatoes and chop into 3cm chunks.",
      "Trim the cauliflower stalk, remove any tough outer leaves, then chop the cauliflower and nice leaves the same size as the spuds.",
      "Finely slice the coriander stalks (reserving the leaves in a bowl of cold water). In a 30cm x 40cm roasting tray, toss the veg and coriander stalks with a pinch of sea salt and black pepper, and 1 tablespoon each of olive oil and red wine vinegar.",
      "Sit the chicken in the tray and rub all over with the tikka paste, getting into all the nooks and crannies.",
      "Place the chicken directly on the bars of the oven, scrunch everything in the tray and place exactly underneath the chicken to catch the tasty juices.",
      "Roast for 1 hour, or until everything is golden and cooked through, turning the veg halfway.",
      "Sit the chicken on top of the veg to rest for 5 minutes, then sprinkle over the drained coriander leaves and serve, tossing the veg in all the tasty juices before dishing up."
    ]
  },
  {
    "title" : "Gluten-free beef lasagne",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/oldImages/430_575/1113_1_1437994308.jpg",
    "likes" : "10k",
    "time" : "3H 15 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"10",
    "calories":"398",
    "fat":"21 g",
    "protein":"21.6 g",
    "ingredients": [
      {
        "quantity": "2",
        "measure": "units",
        "name": "carrots"
      },
      {
        "quantity": "2",
        "measure": "units",
        "name": "onions"
      },
      {
        "quantity": "2",
        "measure": "units",
        "name": "cloves of garlic"
      },
      {
        "quantity": "10",
        "measure": "ml",
        "name": "olive oil"
      },
      {
        "quantity": "2",
        "measure": "rashers",
        "name": "bacon"
      },
      {
        "quantity": "1",
        "measure": "a buntch of",
        "name": "fresh thyme"
      },
      {
        "quantity": "500",
        "measure": " g",
        "name": "beef mince"
      },
      {
        "quantity": "40",
        "measure": " ml",
        "name": "red wine"
      },
      {
        "quantity": "1",
        "measure": " unit",
        "name": "beef cube"
      },
      {
        "quantity": "800",
        "measure": " g",
        "name": "tomatoes"
      },
      {
        "quantity": "10",
        "measure": " g",
        "name": "sea salt"
      },
      {
        "quantity": "10",
        "measure": " g",
        "name": "black pepper"
      },
      {
        "quantity": "1",
        "measure": " unit",
        "name": "pasta"
      }
    ],
    "steps": [
      "To make the Bolognese sauce, finely chop the carrots, onions, garlic and celery and add to a large, wide pan over a medium heat with a drizzle of olive oil. Roughly chop and add the bacon, then pick in the thyme leaves and cook for 5 to 10 minutes, or until softened and lightly golden.",
      "Turn the heat up slightly, then stir in the beef mince, breaking it up with a wooden spoon. Cook for around 5 minutes, or until browned all over. Add the wine and crumble in the stock cube, stirring continuously until the liquid has completely reduced. Stir in the tomatoes and 1 tin’s worth of water and bring to the boil. Reduce to a simmer, cover and cook for around 1 hour, then remove the lid and continue cooking for 30 minutes, or until thickened and reduced.",
      "Meanwhile, preheat the oven to 180ºC/350ºF/gas 4. Make the béchamel sauce: place the milk, butter and flours in a medium pan over a low heat. Heat gently, whisking continuously for 12 to 15 minutes, or until thickened. Grate in three-quarters of the Parmesan and a good grating of nutmeg. Season to taste, then set aside.",
      "Cut the sheets of pasta into rectangles (roughly 10cm x 15cm).",
      "Spoon one-third of the Bolognese sauce into an ovenproof dish (roughly 25cm x 30cm). Layer over one-third of the lasagne sheets and top with one-third of the béchamel sauce. Repeat with the remaining ingredients until you have three layers in total, finishing with a final layer of béchamel. Grate over the remaining Parmesan and drizzle with olive oil, then cover with tin foil. Place in the hot oven for around 20 minutes, remove the foil and continue cooking for around 30 minutes, or until golden and bubbling. Serve with a nice, crisp salad."
    ]
  },
  {
    "title" : "Asian salmon traybake",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/52PsxSQ6adABT58ca-ar0X.jpg",
    "likes" : "45k",
    "time" : "50 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"4",
    "calories":"392",
    "fat":"20.1 g",
    "protein":"32.5 g",
    "ingredients": [
      {
        "quantity": "1",
        "measure": " large unit",
        "name": " sweet potato"
      },
      {
        "quantity": "2",
        "measure": "sticks of ",
        "name": "lemongrass"
      },
      {
        "quantity": "3",
        "measure": "cm piece",
        "name": "ginger"
      },
      {
        "quantity": "150",
        "measure": "ml",
        "name": "vegetable stock"
      },
      {
        "quantity": "150",
        "measure": "teaspoon",
        "name": "sesame oil"
      },
      {
        "quantity": "1",
        "measure": "teaspoon",
        "name": "sesame oil"
      },
      {
        "quantity": "1",
        "measure": "ml",
        "name": "coconut milk"
      },
      {
        "quantity": "1",
        "measure": " unit",
        "name": "lime"
      },
      {
        "quantity": "1",
        "measure": " long unit",
        "name": "red chilli"
      },
      {
        "quantity": "600",
        "measure": "g",
        "name": "salmon fillets"
      }
    ],
    "steps": [
      "Preheat the oven to 190ºC",
      "Scrub the sweet potato clean, then slice into thin rounds. Arrange the slices, overlapping, in a large roasting tin.",
      "Bruise the lemongrass, then finely chop the tender parts. Peel and finely chop the ginger and garlic. Peel and finely slice the chilli.",
      "Mix the sesame oil, stock, coconut milk and two-thirds each of the lemongrass, ginger and garlic. Pour over the potatoes, tuck in the lime leaves (or squeeze the juice on top and scatter over the zest) and sprinkle with the chilli.",
      "Roast for 20 to 25 minutes, or until the potatoes are done. About 8 to 10 minutes before the cooking time is up, sit the fish on the potatoes and top with the rest of the lemongrass, ginger and garlic.",
      "When the fish is just cooked, drizzle with soy sauce, if you like. Delicious served with green beans and mangetout."
    ]
  },
  {
    "title" : "Salmon and pesto",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/5p9W_lsfaXkAqPVhKib0AR.jpg",
    "likes" : "89k",
    "time" : "30 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"4",
    "calories":"473",
    "fat":"24.2 g",
    "protein":"36.3 g",
    "ingredients": [
      {
        "quantity": "600",
        "measure": "g",
        "name": " potatoes"
      },
      {
        "quantity": "200",
        "measure": "g",
        "name": "green beans"
      },
      {
        "quantity": "200",
        "measure": "g",
        "name": "broccoli"
      },
      {
        "quantity": "480",
        "measure": "g",
        "name": "salmon fillets"
      },
      {
        "quantity": "250",
        "measure": "g",
        "name": "pak choi"
      },
      {
        "quantity": "10",
        "measure": "ml",
        "name": "olive oil"
      },
      {
        "quantity": "1",
        "measure": "unit",
        "name": "lemon"
      }
    ],
    "steps": [
      "To make the pesto, place a small frying pan over a medium heat, tip in the pine nuts and toast until very lightly golden – keep them moving so they don’t burn, then place in a small bowl and put to one side.",
      "Peel the garlic, then place in a pestle and mortar with a pinch of sea salt.",
      "Pick and tear in the basil leaves.",
      "Bash the mixture to a paste, then add the pine nuts and pound again, leaving a little bit of texture. Scrape the mixture into the small bowl.",
      "Add 2 to 3 tablespoons of extra virgin olive oil – you need just enough to bind the pesto and give it an oozy consistency – then finely grate and stir through the Parmesan.",
      "Add a squeeze of lemon juice. Have a taste and season with a pinch of black pepper and a squeeze more lemon juice, if you think it needs it.",
      "Scrub the potatoes well, then trim the beans and broccoli.",
      "Fill a large pan three quarters of the way up with boiling water, add a pinch of salt and bring to the boil.",
      "Once boiling, carefully add the potatoes and cook for 15 minutes, adding the beans and the broccoli for the final 5 minutes.",
      "Meanwhile, heat a large non-stick frying pan over a high heat.",
      "Rub the salmon fillets all over with olive oil and season with salt and pepper.",
      "Place in the hot pan, skin-side down, turn the heat down to medium and cook for 4 minutes, or until golden underneath.",
      "Use a fish slice to turn them over, then cook the fillets for a further 2 to 3 minutes, or until just cooked through.",
      "Remove the pan from the heat, rest for 30 seconds, then add a good squeeze of lemon juice and give the pan a good shake.",
      "Drain the vegetables well, then tip into to a large bowl. Add the pesto, then use tongs to coat everything nicely.",
      "Divide the fish fillets and vegetables between your plates, drizzle over the juices from the pan, then serve with lemon wedges for squeezing over."
    ]
  },
  {
    "title" : "Chocolate mousse",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/46259046.jpg",
    "likes" : "130k",
    "time" : "2H 30 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"12",
    "calories":"382",
    "fat":"21.6 g",
    "protein":"10.2 g",
    "ingredients": [
      {
        "quantity": "350",
        "measure": "g",
        "name": " dark chocolate"
      },
      {
        "quantity": "100",
        "measure": "ml",
        "name": "double cream"
      },
      {
        "quantity": "10",
        "measure": "units",
        "name": "eggs"
      },
      {
        "quantity": "50",
        "measure": "g",
        "name": "sugar"
      },
      {
        "quantity": "500",
        "measure": "g",
        "name": "prunes"
      },
      {
        "quantity": "150",
        "measure": "ml",
        "name": "whisky"
      },
      {
        "quantity": "100",
        "measure": "ml",
        "name": "orange juice"
      }
    ],
    "steps": [
      "Prepare the prunes the night before: combine all the ingredients in a bowl and leave to soak overnight.",
      "The next day, break up the chocolate and melt in a bowl set over a pan of simmering water, ensuring the bowl doesn’t touch the water. Remove the bowl from the heat and allow to cool.",
      "Warm the cream in a pan over a low heat, then mix into the chocolate until smooth.",
      "Separate the eggs and beat the egg whites and sugar with an electric whisk until fluffy. Whisk the yolks into the chocolate mixture, then gently fold this through the beaten egg whites.",
      "Place the prunes in the base of a deep, glass trifle dish, pressing them against the sides. Pour over the mousse and allow to set in the fridge for at least 2 to 3 hours.",
      "Shave over a little extra chocolate, and serve."
    ]
  },
  {
    "title" : "Double-choc brownies",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/6PweCQhr4LW80P20D_nC1b.jpg",
    "likes" : "210k",
    "time" : "50 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"12",
    "calories":"383",
    "fat":"22.4 g",
    "protein":"5 g",
    "ingredients": [
      {
        "quantity": "100",
        "measure": "g",
        "name": " butter"
      },
      {
        "quantity": "150",
        "measure": "g",
        "name": "flour"
      },
      {
        "quantity": "300",
        "measure": "g",
        "name": "sugar"
      },
      {
        "quantity": "1",
        "measure": "teaspoons",
        "name": " vanilla extract"
      },
      {
        "quantity": "3",
        "measure": "large units off",
        "name": "eggs"
      },
      {
        "quantity": "75",
        "measure": "g",
        "name": "dark chocolate"
      },
      {
        "quantity": "75",
        "measure": "g",
        "name": "white chocolate"
      },
      {
        "quantity": "100",
        "measure": "g",
        "name": "hazelnuts"
      },
      {
        "quantity": "1",
        "measure": "tablespoon",
        "name": "cocoa powder"
      }
    ],
    "steps": [
      "Preheat the oven to 170ºC/gas 3. Grease and dust a 15cm x 25cm baking dish.",
      "Melt the butter and sugar in a pan over a medium heat",
      "Stir in the flour and vanilla, and crack in the eggs, then divide between 2 bowls.",
      "Chop the dark and white chocolate, keeping them separate. Chop the nuts.",
      "Mix the cocoa, dark chocolate and half the nuts into one bowl, then stir the white chocolate and remaining nuts into the other.",
      "Place alternate spoonfuls into the prepared dish, swirling it through.",
      "Bake for 30 to 40 minutes, or until an inserted skewer comes out clean."
    ]
  },
  {
    "title" : "Moorish crunch salad",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/8EDENOCEKbAB5AS4UtzHMh.jpg",
    "likes" : "18k",
    "time" : "40 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"2",
    "calories":"573",
    "fat":"20.6 g",
    "protein":"19.3 g",
    "ingredients": [
      {
        "quantity": "150",
        "measure": "g",
        "name": " wholewheat couscous"
      },
      {
        "quantity": "1",
        "measure": " unit",
        "name": "lemon"
      },
      {
        "quantity": "150",
        "measure": "g",
        "name": "carrots"
      },
      {
        "quantity": "1",
        "measure": " unit",
        "name": "onion"
      },
      {
        "quantity": "4",
        "measure": "tablespoons of",
        "name": "white wine vinegar"
      },
      {
        "quantity": "15",
        "measure": "g",
        "name": "fresh mint"
      },
      {
        "quantity": "180",
        "measure": "g",
        "name": "filo pastry"
      },
      {
        "quantity": "4",
        "measure": "tablespoons of",
        "name": "natural yoghurt"
      },
      {
        "quantity": "2",
        "measure": "tablespoons of",
        "name": "peanut butter"
      },
      {
        "quantity": "1",
        "measure": "unit",
        "name": "lime"
      },
      {
        "quantity": "10",
        "measure": "ml",
        "name": "olive oil"
      },
      {
        "quantity": "40",
        "measure": "g",
        "name": "pistachios"
      },
      {
        "quantity": "3",
        "measure": "g",
        "name": "oranges"
      },
      {
        "quantity": "1",
        "measure": "unit",
        "name": "lettuce"
      }
    ],
    "steps": [
      "Preheat the oven to 180°C",
      "Place the couscous in a bowl. Finely chop and add the preserved lemon(s), removing any pips, then just cover with boiling kettle water, pop a plate on top and leave to fluff up.",
      "Wash the carrots and quarter lengthways. Peel, halve and finely slice the onion. Toss both in a shallow bowl with the vinegar and a good pinch of sea salt to draw out excess moisture (you’ll drain the liquor off, so don’t worry about the amount of salt).",
      "Pick and finely chop most of the mint leaves and stir through the couscous, fluffing it up with a fork, then season to perfection.",
      "Unroll the filo pastry and spoon one quarter of the couscous on to the middle of one sheet. Flatten into a square, then fold the filo up around it, creating a square parcel.",
      "Repeat with the remaining couscous and filo, then place the parcels on a tray and bake for 20 minutes, or until lightly golden and crisp – this is a cute way to serve couscous and adds epic texture to the salad.",
      "In a bowl, mix the yoghurt, peanut butter, 2 teaspoons of preserved lemon liquor from the jar and the lime juice, loosening with a splash of water, if needed.",
      "Loosen the harissa with 1 tablespoon of oil in a little bowl. Crush the pistachios in a pestle and mortar. Peel the oranges and cut into thin rounds. Wash the lettuces, trim the bases, then cut the round lettuce into quarters and the little gems in half.",
      "Now the fun bit: to serve, divide the lettuce between your plates and drizzle over the peanutty yoghurt dressing.",
      "Drain and divide up the pickled carrots and onions, then tear each filo parcel in half and add to the plates with a few orange slices.",
      "Drizzle the parcels with harissa oil, scatter with pistachios, pick over the remaining mint leaves, then mix it all up and tuck in!"
    ]
  },
  {
    "title" : "Spinach pici pasta",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/7s5f0uUOa8lBK3MzNA1Qjn.jpg",
    "likes" : "46k",
    "time" : "50 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"4",
    "calories":"500",
    "fat":"21.6 g",
    "protein":"20.2 g",
    "ingredients": [
      {
        "quantity": "200",
        "measure": "g",
        "name": " spinach"
      },
      {
        "quantity": "300",
        "measure": "g",
        "name": "flour"
      },
      {
        "quantity": "10",
        "measure": "ml",
        "name": "olive oil"
      },
      {
        "quantity": "4",
        "measure": "units",
        "name": "garlic"
      },
      {
        "quantity": "1",
        "measure": "teaspoon",
        "name": "red chilli"
      },
      {
        "quantity": "200",
        "measure": "g",
        "name": "courgettes"
      },
      {
        "quantity": "320",
        "measure": "g",
        "name": "cherry tomatoes"
      },
      {
        "quantity": "15",
        "measure": "g",
        "name": "fresh basil"
      },
      {
        "quantity": "50",
        "measure": "g",
        "name": "pine nuts"
      },
      {
        "quantity": "50",
        "measure": "g",
        "name": "Parmesan cheese"
      }
    ],
    "steps": [
      "In a food processor, blitz the spinach and flour until a ball of dough forms, letting the machine do all the work. Touch the dough – it shouldn’t be sticky, you want a playdough consistency, so add a little more flour, if needed.",
      "To make the pici, simply tear off 2cm balls of dough and roll them out into long thin sausage shapes – think fine green beans – on a clean surface (the beauty is that they’re all different, so get little helpers involved, if you can).",
      "Cook the pici straight away, or leave them to dry out for a few hours, or even overnight.",
      "Put a large pan of salted water on to boil. Put a large frying pan on a medium heat with 2 tablespoons of olive oil. Peel, finely slice and add the garlic, along with the chilli flakes.",
      "Finely slice and add the courgettes, then halve and add the tomatoes. Cook it all for 5 minutes, then stir in the pine nuts and add a ladleful of boiling water. Leave on the lowest heat while you cook the pasta.",
      "Add the pici to your pan of boiling salted water. If it’s freshly rolled it will only need about 5 minutes, but if you’ve let it dry give it 8 to 10 minutes, checking on it to make sure you get lovely al dente pasta.",
      "Drain, reserving a mugful of cooking water, then toss through the veg.",
      "Reserving the baby basil leaves, finely slice the bigger ones and stir into the pan with most of the finely grated Parmesan, loosening with a little reserved water, if needed.",
      "Divide between your warm plates and serve with a few drips of extra virgin olive oil, with the remaining Parmesan and the baby basil leaves sprinkled over."
    ]
  },
  {
    "title" : "Lamb and chickpea curry",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/46287891.jpg",
    "likes" : "89k",
    "time" : "2H 20 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"6",
    "calories":"263",
    "fat":"11.7 g",
    "protein":"17.1 g",
    "ingredients": [
      {
        "quantity": "10",
        "measure": "ml",
        "name": "olive oil"
      },
      {
        "quantity": "300",
        "measure": "g",
        "name": "lean lamb shoulder"
      },
      {
        "quantity": "1",
        "measure": "teaspoon",
        "name": "mustard seeds"
      },
      {
        "quantity": "1",
        "measure": "teaspoons",
        "name": "ground turmeric"
      },
      {
        "quantity": "1",
        "measure": "teaspoon",
        "name": "chilli powder"
      },
      {
        "quantity": "1",
        "measure": "tablespoon",
        "name": "curry powder"
      },
      {
        "quantity": "5",
        "measure": "cm piece",
        "name": "ginger"
      },
      {
        "quantity": "4",
        "measure": "units",
        "name": "garlic"
      },
      {
        "quantity": "3",
        "measure": "units",
        "name": "onions"
      },
      {
        "quantity": "10",
        "measure": "units of",
        "name": "curry leaves"
      },
      {
        "quantity": "800",
        "measure": "g",
        "name": "tins of chickpeas"
      },
      {
        "quantity": "200",
        "measure": "g",
        "name": "spinach"
      },
      {
        "quantity": "1",
        "measure": " bunch",
        "name": "coriander"
      }
    ],
    "steps": [
      "Heat 1 tablespoon of oil in a large pan over a medium heat, add the lamb, spices and curry powder, then cook gently for 15 minutes, or until browned all over, stirring occasionally.",
      "Meanwhile, peel and finely slice the ginger, garlic and onions. Add the sliced ingredients and curry leaves to the pan, then cook for a further 10 to 15 minutes, or until softened, stirring occasionally.",
      "Tip in the chickpeas (and their juice), then crumble in the stock cube. Pour in the tomatoes and 1 tin’s worth of hot water.",
      "Season lightly with sea salt and black pepper, then slowly bring to the boil, breaking up the tomatoes with the back of a spoon.",
      "Cover with a lid, reduce the heat to low, and simmer gently for 1 hour 30 minutes, or until the lamb is tender and the sauce has thickened and reduced, occasionally stirring and scraping any bits from the bottom of the pan",
      "Add the coconut milk and spinach to the pan, stir well, then bring just back to the boil.",
      "Have a taste and season to perfection, then tear the coriander leaves over the top. Delicious served with brown basmati rice."
    ]
  },
  {
    "title" : "Caribbean turkey",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/46256570.jpg",
    "likes" : "12k",
    "time" : "6H 20 Minutes",
    "Difficulty":"Showing off",
    "serves":"18",
    "calories":"963",
    "fat":"42.2 g",
    "protein":"15.2 g",
    "ingredients": [
      {
        "quantity": "5",
        "measure": "Kg",
        "name": " turkey"
      },
      {
        "quantity": "4",
        "measure": "units",
        "name": "carrots"
      },
      {
        "quantity": "2",
        "measure": "units",
        "name": "clementines"
      },
      {
        "quantity": "1",
        "measure": "init",
        "name": "orange"
      },
      {
        "quantity": "2",
        "measure": "large units",
        "name": "onions"
      },
      {
        "quantity": "2",
        "measure": "sticks",
        "name": "celery"
      }
    ],
    "steps": [
      "For the marinade, mix the tamarind paste with 3 tablespoons of boiling water, crush the allspice berries, zest and juice the orange, finely grate half the nutmeg, pick the thyme leaves and roughly chop the bay. Combine these and all the remaining marinade ingredients in a bowl or dish that’s large enough to hold the turkey.",
      "Place the turkey in the dish and rub the marinade all over. Cover with clingfilm. If you don’t have a large enough container, transfer the turkey to a large plastic bag and pour the marinade over it. Refrigerate to marinate overnight.",
      "For the spicy cornbread, preheat the oven to 220ºC/gas 7. Line the base and sides of a 24cm x 24cm baking dish with greaseproof paper and grease the paper. Peel and chop the onion, drain the sweetcorn, deseed and finely chop the Scotch bonnet, then melt the butter. Heat the oil in a pan, add the onion and cook over a medium heat for 3 to 5 minutes until softened. Transfer to a bowl, allow to cool, then add the corn and chilli.",
      "In a separate bowl, combine the flour, polenta, baking powder, sugar and 1 teaspoon sea salt, then stir in the onions. Stir in the milk and melted butter until combined.",
      "Pour the mixture into the prepared baking dish and cut off any excess paper with scissors. Bake for 35 to 40 minutes, until golden brown. Remove from the oven and cool in the pan. You can cook the bread the day before you eat and store in an airtight container.",
      "For the stuffing, peel and roughly chop the onion and garlic, deseed and finely chop the Scotch bonnet, skin and roughly chop the chorizo and roughly chop the spicy cornbread. Drain and roughly chop the peppers, pick and roughly chop the coriander leaves, pick the thyme leaves and roughly chop the bay. Heat the oil in a large pan over a medium heat. Add the onion, scotch bonnet and chorizo and cook for 8 to 10 minutes. Transfer to a large bowl and let cool then mix in all the stuffing ingredients.",
      "For the rum butter, put all ingredients in a food processor and blitz until combined. Chill until ready to use.",
      "Preheat the oven to its highest temperature. Remove the turkey from the fridge and place on a large board (reserve the marinade for basting). Carefully pack as much of the stuffing into the neck cavity as you can fit. Take some small metal skewers and pierce the skin on either side to close the cavity and keep the stuffing in. Put the remaining stuffing in a lightly greased baking dish and set aside in the fridge.",
      "Halve the carrots lengthways, peel and slice the clementines, and halve the orange. Peel and cut the onions into wedges, and roughly chop the celery. Put the carrot, fruit, onion and celery in a large roasting tin then place the turkey on top. Rub the rum butter all over the turkey, season well, then brush with some marinade and place in the oven. Cook for 8 to 10 minutes at the highest heat then reduce the heat to 180ºC/gas 4, cover the turkey with foil and roast for 35 to 40 minutes per kilo, basting with the marinade every 30 minutes.",
      "Remove the foil during the last hour of cooking so the skin gets crisp, and baste more frequently. You can use a meat thermometer to check if it’s cooked – insert into the thickest part of the breast; the turkey is ready when it registers 72ºC. Add the tray of stuffing to the oven for the last 15 minutes of cooking time, and bake while the turkey rests (45 minutes in total).",
      "Transfer the turkey to a board (reserve the pan juices), and brush off some of the blackened marinade to reveal the bronzed skin. Cover with 2 layers of foil and 2 tea towels and rest for at least 30 minutes.",
      "Chop the kale and boil in salted water for 5 minutes, till tender. Drain, reserving some of the water. Finely slice the chilli and peel and finely slice the garlic. Heat the oil in a pan over a medium heat, add the chilli and garlic and sauté for 3 to 5 minutes. Add the kale, stir well then transfer to a serving bowl.",
      "Next, make the gravy. Remove the excess fat from the reserved pan juices, then place the pan on a medium heat and stir. Add the flour and stir for a few minutes then add the rum, tomato paste and a little of the kale’s cooking water. Reduce the heat to low and simmer for 8 to 10 minutes or until beginning to thicken. Strain into a jug.",
      "Transfer the turkey to a serving platter, and transfer the extra stuffing to the open cavity. Carry to the table, carve and serve slices with stuffing, kale, gravy. Delicious served with mashed potatoes."
    ]
  },
  {
    "title" : "Chicken milanese",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/46262582.jpg",
    "likes" : "57k",
    "time" : "45 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"2",
    "calories":"965",
    "fat":"24.1 g",
    "protein":"68.8 g",
    "ingredients": [
      {
        "quantity": "2",
        "measure": " units",
        "name": " garlic"
      },
      {
        "quantity": "1",
        "measure": " a bunch of",
        "name": " fresh basil"
      },
      {
        "quantity": "10",
        "measure": " ml",
        "name": "olive oil"
      },
      {
        "quantity": "400",
        "measure": "g",
        "name": "tomatoes"
      },
      {
        "quantity": "100",
        "measure": "g",
        "name": "flour"
      },
      {
        "quantity": "2",
        "measure": " large units of",
        "name": "eggs"
      },
      {
        "quantity": "300",
        "measure": "g",
        "name": "chicken breasts"
      },
      {
        "quantity": "100",
        "measure": "g",
        "name": "breadcrumbs"
      },
      {
        "quantity": "30",
        "measure": "g",
        "name": "Parmesan cheese"
      },
      {
        "quantity": "150",
        "measure": "g",
        "name": "Spaghetti"
      }
    ],
    "steps": [
      "Peel and finely slice the garlic. Pick the basil leaves, then finely chop the stalks.",
      "Heat a splash of oil in a medium saucepan over a medium heat. Add the garlic and basil stalks and cook for 2 minutes, or until golden.",
      "Tip the tinned tomatoes into the pan and squash them down with the back of a spoon. Fill the empty tomato tin with water and pour this in too. Season and simmer for 30 minutes, or until reduced, glossy and thick.",
      "Place the chicken breasts on a board and cover with a double layer of clingfilm. Bash with a saucepan to flatten them to 5mm thick.",
      "Tip the flour into one bowl, then crack and beat the eggs in a second bowl. Add the breadcrumbs to a third, finely grate in half of the Parmesan, then shake to combine.",
      "Coat the chicken in the flour, then the egg and finally in the cheesy breadcrumbs, until thoroughly coated.",
      "Heat a lug of oil in a large frying pan over a medium heat and cook the chicken for 3 to 4 mins on each side, or until golden and the meat is cooked through.",
      "Cook the spaghetti according to the packet instructions, then drain and add to the tomato sauce, loosening with a little of the cooking water if needed.",
      "Serve the pasta alongside the crispy chicken, with the remaining Parmesan and basil leaves scattered over."
    ]
  },
  {
    "title" : "Scrambled egg omelette",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/430_575/55846374.jpg",
    "likes" : "100k",
    "time" : "10 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"2",
    "calories":"356",
    "fat":"28.9 g",
    "protein":"20.9 g",
    "ingredients": [
      {
        "quantity": "350",
        "measure": "g",
        "name": " tomatoes"
      },
      {
        "quantity": "15",
        "measure": "g",
        "name": "fresh basil"
      },
      {
        "quantity": "15",
        "measure": "g",
        "name": "red chilli"
      },
      {
        "quantity": "63",
        "measure": "g",
        "name": "ball of mozzarella"
      },
      {
        "quantity": "4",
        "measure": "large units",
        "name": "eggs"
      }
    ],
    "steps": [
      "Finely slice the tomatoes, arrange over a sharing platter, then dress with a little extra virgin olive oil, red wine vinegar, sea salt and black pepper.",
      "Pick most of the basil leaves into a pestle and mortar, pound with a pinch of salt into a paste, then muddle in 1 tablespoon of extra virgin olive oil to make a basil oil.",
      "Finely slice the chilli. Finely chop the mozzarella.",
      "Place a 26cm non-stick frying pan on a medium heat with ½ a tablespoon of olive oil. Beat and pour in the eggs, then stir regularly with a rubber spatula, moving the eggs gently around the pan.",
      "Scoop the crispy fat and ginger out and put aside, then add the steak chunks to the pan",
      "When they’re lightly scrambled but still loose, stop stirring and scatter the mozzarella in the centre, then drizzle over the basil oil. Let the bottom of the eggs set for 1 minute, then – technique time – pick up the pan, tilt it down and, with your other hand, keep tapping your wrist until it shakes the eggs up the side of the pan; use the spatula to flip it back to the middle, then fold the top half back over, too. Turn it upside down on to the tomato platter, set side up.",
      "Slice down the centre to reveal the oozy scrambled eggs in the middle. Scatter over the chilli (as much as you dare!) and remaining basil leaves, and tuck on in."
    ]
  },
  {
    "title" : "Chocolate rye cookies",
    "image_url" : "https://cdn.jamieoliver.com/recipe-database/xtra_med/55846354.jpg",
    "likes" : "129k",
    "time" : "28 Minutes",
    "Difficulty":"Not Too Tricky",
    "serves":"24",
    "calories":"76",
    "fat":"5.2 g",
    "protein":"1.2 g",
    "ingredients": [
      {
        "quantity": "100",
        "measure": "g",
        "name": " dark chocolate"
      },
      {
        "quantity": "100",
        "measure": "g",
        "name": "butter"
      },
      {
        "quantity": "100",
        "measure": "g",
        "name": "bread"
      },
      {
        "quantity": "2",
        "measure": "large units",
        "name": "eggs"
      },
      {
        "quantity": "50",
        "measure": "g",
        "name": "sugar"
      }
    ],
    "steps": [
      "Preheat the oven to 200ºC.",
      "Line two trays with greaseproof paper and rub with olive oil.",
      "Melt the chocolate in a heatproof bowl over a pan of gently simmering water, then remove and stir in the butter so it melts. ",
      "Tear the bread into a food processor and blitz into fine crumbs, then add the eggs and sugar, and blitz again well.",
      "With the processor still running, pour in the chocolate mixture and let it blitz until combined.",
      "Spoon the cookie mix into a large sandwich bag, snip off the corner and pipe 3–4cm blobs to make 24 cookies on the lined trays. Bake for 8 to 10 minutes, or until spread and set.",
      "Sprinkle with sea salt, leave to cool a little, and tuck in."
    ]
  }

]